# ---------- Стадия 1: сборка бинарника ----------
# Берём официальный образ с Go и Linux (alpine — облегчённый дистрибутив)
FROM golang:1.25-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Сначала копируем только файлы модулей
# Это позволяет кешировать слои и ускоряет последующие сборки
COPY go.mod go.sum ./
RUN go mod download

# Теперь копируем весь остальной код
COPY . .

# Собираем бинарник нашего приложения
# cmd/api — это путь к main.go
RUN CGO_ENABLED=0 GOOS=linux GOARCH=amd64 go build -o todo-app ./cmd/api

# ---------- Стадия 2: лёгкий образ для запуска ----------
FROM alpine:3.20

# Рабочая директория для рантайма
WORKDIR /app

# Копируем только бинарник из стадии builder
COPY --from=builder /app/todo-app .

# Сообщаем, что приложение слушает порт 8080
EXPOSE 8080

# Для Gin ставим режим release (чтобы лишний шум логов убрать)
ENV GIN_MODE=release

# Команда, которая будет выполняться при старте контейнера
CMD ["./todo-app"]
